eda/writing/limericks/index.org
* Bear-related
** Feeding honey to a bear
   While feeding honey to a bear,

   I fix him with a fearsome stare.  

   The bear (Carl) asks for more.  

   Should I go to the store?  

   Would Carl take my pocket eclair?  

* Cow/fairy-related
** Canary in a cow-mine
   Fearing from fourteen fierce fairies,
   
   Cows contacted a canary.
   
   But it was bird-brained.
   
   No peace was obtained.
   
   Heffers' helper made things hairy.

* Ferret/flamingo-related
** Let my people furrow
   Fearful of four fighting flamingoes,

   Ferrets find fulfillment in furrows.

   After finding fields fallow

   Few tell the rest to follow.

   Fellow ferrets face their final foes.
