eda/writing/limericks/index.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Bear-related</a>
<ul>
<li><a href="#sec-1-1">1.1. Feeding honey to a bear</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Cow/fairy-related</a>
<ul>
<li><a href="#sec-2-1">2.1. Canary in a cow-mine</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Ferret/flamingo-related</a>
<ul>
<li><a href="#sec-3-1">3.1. Let my people furrow</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Bear-related</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Feeding honey to a bear</h3>
<div class="outline-text-3" id="text-1-1">
<p>
While feeding honey to a bear,
</p>

<p>
I fix him with a fearsome stare.  
</p>

<p>
The bear (Carl) asks for more.  
</p>

<p>
Should I go to the store?  
</p>

<p>
Would Carl take my pocket eclair?  
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Cow/fairy-related</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Canary in a cow-mine</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Fearing from fourteen fierce fairies,
</p>

<p>
Cows contacted a canary.
</p>

<p>
But it was bird-brained.
</p>

<p>
No peace was obtained.
</p>

<p>
Heffers' helper made things hairy.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Ferret/flamingo-related</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Let my people furrow</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Fearful of four fighting flamingoes,
</p>

<p>
Ferrets find fulfillment in furrows.
</p>

<p>
After finding fields fallow
</p>

<p>
Few tell the rest to follow.
</p>

<p>
Fellow ferrets face their final foes.
</p>
</div>
</div>
</div>
